Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: ལྷ་རྣམས་ཀྱིས་བདེན་པ་མཐོང་བ་དང་། གནོད་སྦྱིན་རྣམས་དང་།
en: May the devas see the truth.

source: ཀླུ་རྣམས་དང་། ལྷ་མ་ཡིན་རྣམས་ཀྱང་འཕགས་པའི་གསོ་སྦྱོང་ཡན་ལག་བརྒྱད་དང་ལྡན་པ་ལ་གནས་པ་དང་།
en: May yakṣas, nāgas, and asuras keep the noble eightfold upoṣadha vows.

source: དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པའི་བར་དག་ཀྱང་ཚངས་པར་སྤྱོད་པ་ལ་གནས་པར་གྱུར་ཅིག །
en: And may even beings that are born as animals maintain celibacy. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བྱང་ཆུབ་ཐོབ་པ་ན་སེམས་ཅན་གང་དག་རབ་ཏུ་སྡང་བའི་སེམས་ཀྱིས་བདག་ལ་མཚོན་ཆའམ། ཞུགས་སམ། མདུང་ངམ། ལག་ཆ་རྣམ་པ་སྣ་ཚོགས་དག་གིས་འདེབས་སུ་མཆི་བ་དང་། ཚིག་རྩུབ་པོ་དང་། བརླང་པོ་དག་གིས་གཤེ་ཞིང་སྤྱོ་བར་འགྱུར་བ་དང་། ཕྱོགས་དང་ཕྱོགས་མཚམས་དག་ཏུ་ཡང་མི་སྙན་པའི་སྒྲ་སྒྲོགས་པར་འགྱུར་བ་དང་།
en: Bhadanta Bhagavat, when I attain enlightenment, there will be those who with malevolence and aggression will attack me with weapons, fire, spears, or various other implements; there will be those who will abuse me with harsh, rough speech, who will criticize me, and who will dishonor me in the principal and intermediate directions; and there will be those who give me poisoned food and drink.

source: དུག་དང་འདྲེས་པའི་བཟའ་བ་དང་། བཏུང་བ་དག་སྟོབས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ལས་ཀྱི་འབྲས་བུ་ཡོངས་སུ་མ་བས་པ་ལ་གནས་ནས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: While I still have those kinds of karmic results remaining, may I attain the complete enlightenment of perfect buddhahood. “ ‘

source: བདག་བྱང་ཆུབ་ཐོབ་པ་ན་སེམས་ཅན་དག་སྔོན་གྱི་འཁོན་གྱིས་འགུམ་པའི་ཡོ་བྱད་ཀྱི་སྦྱོར་བས་བདག་ལ་ཚིག་རྩུབ་པོ་དང་། མཚོན་ཆ་སྣ་ཚོགས་དང་། དུག་དང་འདྲེས་པའི་བཏུང་བ་དག་སྩོལ་བར་འགྱུར་ཞིང་། ཁྲག་ཀྱང་འབྱིན་པར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ལ་བདག་གིས་ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་།
en: When I have attained enlightenment, may I teach the Dharma with a voice that sounds like the drum of Brahmā’s voice, cultivated through good conduct, learning, samādhi, great compassion, and meditation, to those beings who previously, with enmity, used deadly implements against me, spoke harshly to me, struck me in various ways, gave me poisoned food and drink, and caused me to bleed.

source: ཏིང་ངེ་འཛིན་དང་། སྙིང་རྗེ་ཆེན་པོ་བསྒོམས་པའི་ཚངས་པའི་སྒྲ་དབྱངས་ཀྱི་རྔ་སྒྲ་བསྒྲགས་པས་དེ་དག་གི་སེམས་རབ་ཏུ་དང་བར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་པར་འགྱུར་ཞིང་དགེ་བ་ལ་སྦྱོར་བར་ཡང་གྱུར་ཅིག །
en: May I thereby cause their minds to develop faith and may I enjoin them to good action.

source: དེ་ལྟར་སེམས་ཅན་དག་ཀྱང་ལས་ཀྱི་སྒྲིབ་པ་འཆགས་པར་འགྱུར་ཞིང་སླན་ཆད་ཀྱང་སྡོམ་པ་ལེན་པར་གྱུར་ཅིག །
en: May those beings confess their karmic obscuration and from then on keep vows.

source: སེམས་ཅན་དེ་དག་གི་མཐོ་རིས་དང་ཐར་པའི་འབྲས་བུ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་། ཟག་པ་ཟད་པ་ལ་སྒྲིབ་པའི་ཆོས་སུ་ཡང་མ་གྱུར་ཅིག །
en: May those beings have no karmic obscuration that prevents higher existences, and may they have the result of liberation, freedom from desire, and the cessation of pollutions.

source: དེར་བདག་གི་ལས་ཀྱི་འབྲས་བུ་ཡང་ཡོངས་སུ་བས་པ་དང་། མཐར་ཐུག་པ་དང་། བྱང་བར་གྱུར་ཅིག །
en: May my karmic results completely cease there, be finished, and be brought to an end. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་གདུགས་གཅིག་བཞིན་དུ་བདག་གི་སྤུའི་ཁུང་བུ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ལེགས་པར་བརྒྱན་པ་དག་སྤྲུལ་ཞིང་། སངས་རྒྱས་ཀྱི་སྐུ་དེ་དག་ཀྱང་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དག་ཏུ་འགྱེད་པར་གྱུར་ཅིག །སྟོང་པ་མ་ལགས་པ་དག་ཏུ་ཡང་འགྱེད་པར་གྱུར་ཅིག །སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པ་དག་ཏུ་ཡང་འགྱེད་པར་གྱུར་ཅིག །
en: Bhadanta Bhagavat, when I have attained enlightenment, each day may I emanate buddhas as numerous as my pores, their bodies adorned by the thirty-two signs and eighty excellent features of a great being, and may I send those emanated buddhas to empty buddha realms, to buddha realms that are not empty, and to buddha realms with the five degeneracies. “ ‘

source: སངས་རྒྱས་ཀྱི་སྐུ་གཅིག་གིས་ཀྱང་གདུགས་གཅིག་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་སེམས་ཅན་གང་དག་མཚམས་མ་མཆིས་པ་བགྱིད་པ་རྣམས་དང་། དམ་པའི་ཆོས་སྤོང་བ་རྣམས་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་རྣམས་དང་། མི་དགེ་བ་དང་འགྲོགས་པའི་བར་དག་དང་།
en: In those buddha realms there will be beings who have committed the actions with immediate results at death, who reject the Dharma, who malign higher beings, and so on, down to and including those who are involved in nonvirtue.

source: དེ་ན་སེམས་ཅན་གང་དག་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དག་བསླབ་པ་དག་ལ་འདྲེན་མར་བགྱིད་པ་རྣམས་དང་། ཞིག་རལ་ཏུ་སྤྱོད་པ་རྣམས་དང་། ལྟུང་བའི་རྩ་བ་བྱུང་བ་རྣམས་དང་། སེམས་ཀྱི་རྒྱུད་ཚིག་པ་རྣམས་དང་། དགེ་བའི་ལམ་རབ་ཏུ་ཉམས་པ་རྣམས་དང་།
en: Also, there will be beings who have set out in the Śrāvakayāna, or have set out in the Pratyekabuddhayāna, or have set out in the Mahāyāna, whose practice of the training is imperfect or ruined, who have committed the root downfalls, whose minds are burning, who have lost the way of good actions, who are going through the jungle of saṃsāra, who are ruined on a bad path, and who are in great despair.

source: འཁོར་བའི་འབྲོག་དགོན་པར་ཞུགས་པ་རྣམས་དང་། ལམ་ངན་པས་རྣམ་པར་བཅོམ་ཞིང་ཉམ་ང་བ་ཆེན་པོ་ཐོབ་པར་གྱུར་པ་དེ་ལྟ་བུའི་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་དག་ལ་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: Each day may each buddha emanation teach the Dharma to such beings among the hundreds of millions of trillions of beings. “ ‘

source: སེམས་ཅན་གང་དག་དབང་ཕྱུག་ཆེན་པོ་ལ་དད་པའི་སེམས་ཅན་དེ་དག་ལ་ཡང་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་ཀྱིས་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: May I teach the Dharma in the form of Maheśvara to those beings who have faith in Maheśvara.

source: སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་དེ་བདག་གི་བསྔགས་པ་རྗོད་པར་ཡང་གྱུར་ཅིག ། དེར་སེམས་ཅན་རྣམས་སྨོན་ལམ་འདེབས་པ་ལ་བརྩོན་པར་ཡང་གྱུར་ཅིག །
en: May they praise me in the Sahā buddha realm, and may I inspire the beings there to make aspirational prayers.

source: སེམས་ཅན་དེ་དག་གིས་བདག་གི་བསྔགས་པ་ཐོས་ནས། བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འཚལ་ཞིང་སྨོན་ལམ་ཡང་འདེབས་པར་གྱུར་ཅིག །
en: And may those beings who hear the praises of me wish to be reborn in my buddha realm and make an aspirational prayer. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་སེམས་ཅན་དེ་དག་འགུམ་པའི་དུས་ཀྱི་ཚེ་མདུན་དུ་མ་མཆིས་སམ། ཆོས་མ་བསྟན་ཏམ། སེམས་རབ་ཏུ་དང་བར་མ་བགྱིས་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག །
en: Bhadanta Bhagavat, if I do not appear before those beings when they die, teaching the Dharma and inspiring confidence, may I not attain the complete enlightenment of perfect buddhahood.

source: གལ་ཏེ་སེམས་ཅན་དེ་དག་གུམ་ནས་ངན་འགྲོ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རམ། བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་མིའི་ལུས་ཐོབ་པར་མ་གྱུར་ན་བདག་གི་ཆོས་ཐམས་ཅད་ཉམས་པར་གྱུར་ཅིང་། བདག་སླར་ཡང་སྣང་བར་མ་གྱུར་ཅིག །བདག་གིས་སངས་རྒྱས་ཀྱི་མཛད་པ་མཐའ་དག་སྒྲུབ་པར་ཡང་རྔོ་མི་ཐོགས་པར་གྱུར་ཅིག །
en: If those beings go to the lower existences when they die and are not reborn as humans in my buddha realm, may my entire Dharma vanish, may I never reappear again, and may I be incapable of accomplishing all the deeds of a buddha.

source: གལ་ཏེ་སེམས་ཅན་གང་དག་སྲེད་མེད་ཀྱི་བུ་ལ་དད་པ་རྣམས་དང་། སེམས་ཅན་དེ་དག་གུམ་ནས་ངན་འགྲོར་ལྟུང་བའི་བར་དུ་གྱུར་ན། བདག་གི་སངས་རྒྱས་ཀྱི་མཛད་པ་མཐའ་དག་སྒྲུབ་པར་རྔོ་མི་ཐོགས་པར་གྱུར་ཅིག །
en: Likewise, if beings who have faith in Nārāyaṇa fall into the lower existences when they die, may I be unable to accomplish all the deeds of a buddha. “ ‘

source: བདག་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དག་ན་སེམས་ཅན་མཚམས་མ་མཆིས་པ་བགྱིད་པ་དང་། ལམ་ངན་པས་བཅོམ་ཞིང་ཉམ་ང་བ་ཆེན་པོ་ཐོབ་པར་གྱུར་པའི་སེམས་ཅན་དག་གུམ་ནས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དག་གི་མཚན་མ་ནི་འདི་དག་ལགས་ཏེ། སེམས་ཅན་དེ་དག་གི་ཁ་དོག་ས་རྡུལ་ལྟ་བུར་འགྱུར་བ་དང་། ཤ་ཟའི་གདོང་འདྲ་བ་དང་། བསྐྱུད་ངས་པ་དང་།
en: When I have attained enlightenment, may the beings in all buddha realms who have committed the actions with immediate results at death, who are ruined on a bad path, and who are in great despair be reborn in my buddha realm when they die.

source: དྲི་མི་བདའ་བ་དང་། ཚུལ་ཁྲིམས་འཆལ་བ་དང་། ཚེ་ཐུང་བ་དང་། ནད་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཉེན་པ་དང་། སེམས་ཅན་དེ་དག་གི་ཡོ་བྱད་རྣམས་ཀྱང་ཡོངས་སུ་ཉམས་པར་འགྱུར་བ་སྟེ།
en: Those beings will have the following indications: they will have a color that is like soil, they will have faces like piśācas, they will have poor memories, they will smell bad, they will have poor conduct, they will have short lives, they will be afflicted by many illnesses, and they will lose the possessions they own.

source: སེམས་ཅན་དེ་དག་གི་དོན་དུ་བདག་དེའི་ཚེ་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་གླིང་བཞི་པ་ཇི་སྙེད་མཆིས་པར་གྱུར་པའི་གླིང་བཞི་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་དགའ་ལྡན་གྱི་གནས་ནས་འབབ་ཅིང་མའི་མངལ་དུ་སྐྱེ་བ་སྟོན་པར་གྱུར་ཅིག །རྒྱ་ཆེར་བགྱི་ན་གཞོན་ནུ་རྩེ་བ་དང་།
en: For the sake of those beings who are in the four continents in the Sahā world realm at that time, may I manifest to all those beings everywhere in the four continents my descent from the Tuṣita paradise into my mother’s womb, and then my birth.

source: བཟོ་དང་ལས་ཀྱི་གནས་དང་། དཀའ་བ་སྤྱོད་པ་དང་། བདུད་འདུལ་བ་དང་། བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་གླིང་བཞི་པ་ཐམས་ཅད་དུ་སངས་རྒྱས་ཀྱི་མཛད་པ་མཐའ་དག་ཉེ་བར་སྟོན་པར་ཡང་གྱུར་ཅིག །
en: May I manifest the youthful games, the mastery of crafts and works, undergoing hardship, subjugating Māra, attaining the complete enlightenment of buddhahood, turning the wheel of the Dharma, and the entire activity of a buddha to all those beings everywhere in the four continents.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དང་། སྐུ་གདུང་འགོད་པའི་བར་དག་ཉེ་བར་སྟོན་པར་ཡང་གྱུར་ཅིག །
en: And may I then manifest passing into parinirvāṇa and the distribution of my relics. “ ‘

source: བདག་བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་ཚིག་གཅིག་བརྗོད་པས་ཆོས་སྟོན་པར་འགྱུར་ཞིང་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་སེམས་ཅན་གང་ལགས་པ་དེ་དག་གིས་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གཏམ་གྱི་སྡེ་སྣོད་ཀྱི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །རང་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་གང་ལགས་པ་དེ་དག་གིས་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་གཏམ་གྱི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོའི་སེམས་ཅན་གང་ལགས་པ་དེ་དག་གིས་ནི་ཐེག་པ་ཆེན་པོའི་གཏམ་གྱི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: When I have attained enlightenment, may I teach the Dharma by speaking a single utterance, and may those beings who are of the Śrāvakayāna understand the Dharma that is taught to be the piṭaka that gives the Śrāvakayāna teaching, may those who are of the Pratyekabuddhayāna understand the Dharma that is taught to be giving the Pratyekabuddhayāna teaching, and may those who are of the unsurpassable Mahāyāna understand the Dharma that is taught to be giving the unsurpassable Mahāyāna teaching. “ ‘

source: ཚོགས་དང་བྲལ་བའི་སེམས་ཅན་གང་ལགས་པ་དེ་དག་ནི་སྦྱིན་པའི་གཏམ་གྱི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May the beings who have no accumulation of merit understand the Dharma that is taught to be giving the teaching on generosity.

source: བསོད་ནམས་དང་བྲལ་ཞིང་མཐོ་རིས་ཀྱི་བདེ་བ་འཚལ་བའི་སེམས་ཅན་གང་ལགས་པ་དེ་དག་གིས་ནི་ཚུལ་ཁྲིམས་ཀྱི་གཏམ་གྱི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May the beings who are devoid of merit and aspire to the happiness of the higher existences understand the Dharma that is taught to be giving the teaching on good conduct.

source: གཅིག་ལ་གཅིག་འཇིགས་པ་དང་། རྙོག་པའི་སེམས་དང་། རབ་ཏུ་སྡང་བའི་སེམས་དང་ལྡན་པ་གང་ལགས་པ་དེ་དག་གིས་ནི་བྱམས་པ་བརྗོད་པའི་གཏམ་གྱི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May the beings who are afraid of each other, who have polluted minds, and who have minds of anger understand the Dharma that is taught to be giving the teaching on kindness.

source: སྲོག་གཅོད་པ་རྣམས་ཀྱིས་ནི་སྙིང་རྗེ་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །ཕྲག་དོག་དང་།
en: May those beings who kill understand the Dharma that is taught to be giving the teaching on compassion.

source: སེར་སྣས་ཟིལ་གྱིས་ནོན་པ་རྣམས་ཀྱིས་ནི་དགའ་བ་བརྗོད་པའི་གཏམ་གྱི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May the beings who are overcome by envy and greed understand the Dharma that is taught to be giving the teaching on rejoicing.

source: གཟུགས་དང་གཟུགས་མ་མཆིས་པའི་དྲེགས་པས་མྱོས་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱིས་ནི་བཏང་སྙོམས་བརྗོད་པའི་གཏམ་གྱི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those whose minds are intoxicated by the intoxication of forms and the formless understand the Dharma that is taught to be giving the teaching on equanimity. “ ‘

source: འདོད་པ་ལ་འདོད་ཆགས་ཀྱི་དྲེགས་པས་མྱོས་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱིས་ནི་ཡང་དག་པར་མ་ལགས་པ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those whose minds are intoxicated by the intoxication of desire for the desired understand the Dharma that is taught to be giving the teaching on unpleasantness.

source: ཐེག་པ་ཆེན་པོ་པའི་སེམས་ཅན་རྒོད་པས་རྣམ་པར་དཀྲུགས་པའི་སེམས་དང་ལྡན་པ་གང་ལགས་པ་དེ་དག་གིས་ནི་དབུགས་འབྱུང་བ་དང་རྔུབ་པ་དྲན་པ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those beings who follow the Mahāyāna, whose minds are agitated, understand the Dharma that is taught to be giving the teaching on the mindfulness of inhalation and exhalation.

source: ཤེས་རབ་འཆལ་བ་རྣམས་ཀྱིས་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བརྗོད་པས་ཆོས་སྟོན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May the beings who have poor wisdom understand the Dharma that is taught to be giving the teaching on dependent origination.

source: ཐོས་པ་ཉུང་བ་རྣམས་ཀྱིས་ནི་བསྐྱུད་པ་མ་མཆིས་ཤིང་ཐོས་པ་འཛིན་པ་ཆུད་མི་ཟ་བ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those with little learning understand the Dharma that is taught to be giving the teaching on not forgetting what one has learned and not losing one’s memory. “ ‘

source: ལྟ་བ་ངན་པ་ཉམ་ང་བར་གྱུར་པ་རྣམས་ཀྱིས་ནི་སྟོང་པ་ཉིད་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those who are in difficulties due to wrong views understand the Dharma that is taught to be giving the teaching on emptiness.

source: རྣམ་པར་རྟོག་པ་ཀུན་ཏུ་སྤྱོད་པས་ཉམས་པ་རྣམས་ཀྱིས་ནི་མཚན་མ་མ་མཆིས་པ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those who are afflicted by the engagement of conceptualization understand the Dharma that is taught to be giving the teaching on featurelessness.

source: སྨོན་པ་མ་མཆིས་པའི་ཡོངས་སུ་དག་པ་ཉམས་པ་རྣམས་ཀྱིས་ནི་སྨོན་པ་མ་མཆིས་པ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those who are afflicted by the impurity of being without aspiration understand the Dharma that is taught to be giving the teaching on aspirationlessness. “ ‘

source: བསམ་པ་ཡོངས་སུ་མ་དག་པ་རྣམས་ཀྱིས་ནི་བསམ་པ་ཡོངས་སུ་དག་པ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those whose motivation is impure understand the Dharma that is taught to be giving the teaching on pure motivation.

source: རྣམ་པར་འདྲེས་པར་སྤྱོད་པས་ཉམས་པ་རྣམས་ཀྱིས་ནི་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those who are afflicted by inconstant conduct understand the Dharma that is taught to be giving the teaching on never forgetting the aspiration for enlightenment.

source: ཟད་པའི་སྦྱོར་བ་དྲོད་ཉམས་པ་རྣམས་ཀྱིས་ནི་བཅོས་མ་མ་ལགས་པ་བརྗོད་པའི་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: May those who are afflicted by the heat of practicing forbearance understand the Dharma that is taught to be giving the teaching on noncontrivance.

source: ལྷག་པའི་བསམ་པ་ཤིན་ཏུ་སྦྱངས་པ་ཉམས་པ་རྣམས་ཀྱིས་ནི་རྟེན་པ་མ་མཆིས་པ་བརྗོད་པས་ཆོས་བསྟན་པར་འཚལ་བར་གྱུར་ཅིག །
en: By the thorough training in higher motivation, may the beings who are afflicted understand the Dharma that is taught to be giving the teaching on baselessness. “ ‘

source: དེ་བཞིན་དུ་སྦྱར་ཏེ། ཉོན་མོངས་པ་ཅན་གྱི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱིས་ནི་དགེ་བའི་སེམས་བརྗོད་པ་དང་།
en: Similarly, may those whose minds are afflicted understand the Dharma that is taught to be giving the teaching on a virtuous mind.

source: དགེ་བ་མི་བསྐྱུད་པ་རྣམས་ཀྱིས་ནི་རྣམ་པར་སྣང་བྱེད་བརྗོད་པ་དང་།
en: May those whose minds are forgetful of virtue understand it to be giving the teaching on illumination.

source: བདུད་ཀྱི་ལས་ལ་བརྩོན་པ་རྣམས་ཀྱིས་ནི་སྟོང་པ་ཉིད་བརྗོད་པ་དང་།
en: May those who are dedicated to the actions of Māra understand it to be giving the teaching on emptiness.

source: དོན་དམ་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་ནི་མངོན་པར་འཕགས་པ་བརྗོད་པ་དང་།
en: May those who are engaged in attacking others understand it to be giving the teaching on being elevated.

source: ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཉམས་པར་གྱུར་པ་རྣམས་ཀྱིས་ནི་བྲལ་བ་བརྗོད་པ་དང་།
en: May those whose minds are tormented by the various kleśas understand it to be giving the teaching on being free of them.

source: ལམ་མི་མཉམ་པར་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་ནི་རྣམ་པར་ལྡོག་པར་བརྗོད་པ་དང་།
en: May those who have entered an uneven path understand it to be giving the teaching on turning back from it.

source: ཐེག་པ་ཆེན་པོ་ལ་ངོ་མཚར་དུ་རྟོགས་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱིས་ནི་ལྡོག་པ་བརྗོད་པ་དང་།
en: May those whose minds are curious about the Mahāyāna understand it to be giving the teaching on reversal.

source: འཁོར་བས་སྐྱོ་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ནི་དགའ་བ་བརྗོད་པ་དང་།
en: May the bodhisattvas who are weary of saṃsāra understand it to be giving the teaching on delight.

source: དགེ་བ་དང་། ས་དང་། ཡེ་ཤེས་མ་རྟོགས་པ་རྣམས་ཀྱིས་ནི་མ་རྨོངས་པ་བརྗོད་པ་དང་།
en: May those who have not come to know of good actions, the bhūmis, and knowledge understand it to be giving the teaching on not being ignorant of them. “ ‘

source: དགེ་བའི་རྩ་བ་གཞན་དང་གཞན་དག་གིས་ཆོག་པར་འཛིན་པ་རྣམས་ཀྱིས་ནི་ཐོས་པ་བརྗོད་པ་དང་།
en: May those who are content with one another’s good roots understand the Dharma that is taught to be giving the teaching on listening to the Dharma.

source: གཅིག་ལ་གཅིག་སེམས་མི་མཉམ་པ་རྣམས་ཀྱིས་ནི་འོད་ཟེར་ཐོགས་པ་མེད་པ་བརྗོད་པ་དང་།
en: May those whose minds are not in harmony with each other understand it to be giving the teaching on the unimpeded light rays.

source: ལས་དཀའ་བ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་ནི་བྱ་བ་ལ་འཇུག་པ་བརྗོད་པ་དང་།
en: May those who are engaged in difficult actions understand it to be giving the teaching on engaging in what is to be done.

source: འཁོར་གྱིས་འཇིགས་པར་གྱུར་པ་རྣམས་ཀྱིས་ནི་སེང་གེའི་རྟོགས་པ་བརྗོད་པ་དང་།
en: May those who have a fear of assemblies understand it to be giving the teaching on the emblem of the lion.

source: བདུད་བཞིས་ཟིལ་གྱིས་ནོན་པའི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱིས་ནི་དཔའ་བ་བརྗོད་པ་དང་།
en: May those whose minds are overcome by the four māras understand it to be giving the teaching on heroism.

source: སངས་རྒྱས་ཀྱི་ཞིང་སྣང་བར་མ་གྱུར་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ནི་འོད་བཀོད་པ་བརྗོད་པ་དང་།
en: May those beings for whom the buddha realms are not illuminated understand it to be giving the teaching on the array of light.

source: རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་རྣམས་ཀྱིས་ནི་རི་བོའི་ཕུང་པོ་བརྗོད་པ་དང་།
en: May those who have attachment and aversion understand it to be giving the teaching on the mass of a mountain.

source: སངས་རྒྱས་ཀྱི་ཆོས་སྣང་བས་ཟིལ་གྱིས་ནོན་པ་རྣམས་ཀྱིས་ནི་རྒྱལ་མཚན་གྱི་རྩེ་མོའི་དཔུང་རྒྱན་བརྗོད་པ་དང་།
en: May those who are overwhelmed by the radiance of the Buddha’s Dharma understand it to be giving the teaching on the victory banner’s crest ornament.

source: ཤེས་རབ་ཆེན་པོ་དང་བྲལ་བ་རྣམས་ཀྱིས་ནི་སྒྲོན་མ་དང་ལྡན་པ་བརྗོད་པ་དང་།
en: May those who do not have great wisdom understand it to be giving the teaching on the falling meteor.

source: །གཏི་མུག་གི་མུན་པར་མཆིས་པ་རྣམས་ཀྱིས་ནི་ཉི་མའི་སྒྲོན་མ་བརྗོད་པ་དང་།
en: May those who are in the darkness of ignorance understand it to be giving the teaching on the lamp of the sun. “ ‘

source: ཟད་པའི་ངེས་པའི་ཚིག་ལ་བརྩོན་པ་རྣམས་ཀྱིས་ནི་ཡོན་ཏན་འབྱུང་གནས་བརྗོད་པ་དང་།
en: May those who are engaged in the interpretation of the word termination understand the Dharma that is taught to be giving the teaching on the source of qualities.

source: བདག་ལ་དབུ་རྡོས་པ་ལྟ་བུར་མངོན་པར་འཚལ་བ་རྣམས་ཀྱིས་ནི་སྲེད་མེད་ཀྱི་བུ་བརྗོད་པ་དང་།
en: May those who long for the self, which is like a lump of foam, understand it to be giving the teaching on Nārāyaṇa.

source: བློ་གཡོ་ཞིང་འགྱུར་བ་རྣམས་ཀྱིས་ནི་སྙིང་པོ་དང་ལྡན་པ་བརྗོད་པ་དང་།
en: May those whose minds are fickle understand it to be giving the teaching on endowed with the essence.

source: སྤྱི་གཙུག་པ་ལྟར་གདའ་བ་རྣམས་ཀྱིས་ནི་ལྷུན་པོའི་རྒྱལ་མཚན་བརྗོད་པ་དང་།
en: May those who are looked down upon understand it to be giving the teaching on the victory banner of Mount Meru.

source: སྔོན་གྱི་དམ་བཅས་པ་བོར་བ་རྣམས་ཀྱིས་ནི་སྙིང་པོ་ཅན་བརྗོད་པ་དང་།
en: May those who have broken their previous promises understand it to be giving the teaching on possession of the essence.

source: མངོན་པར་ཤེས་པ་ཉམས་པ་རྣམས་ཀྱིས་ནི་རྡོ་རྗེའི་ཚིག་བརྗོད་པ་དང་།
en: May those who have lost their clairvoyance understand it to be giving the teaching on the vajra words.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མངོན་པར་འཚལ་བ་རྣམས་ཀྱིས་ནི་རྡོ་རྗེའི་སྙིང་པོ་བརྗོད་པ་དང་།
en: May those who long for the essence of enlightenment understand it to be giving the teaching on the vajra essence.

source: ཆོས་ཐམས་ཅད་ལ་སྨོན་པ་རྣམས་ཀྱིས་ནི་རྡོ་རྗེ་ལྟ་བུ་བརྗོད་པ་དང་།
en: May those who aspire to all Dharma teachings understand it to be giving the teaching on the resemblance to a vajra. “ ‘

source: སེམས་ཅན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་རབ་ཏུ་འཚལ་བ་རྣམས་ཀྱིས་ནི་སྤྱོད་པ་དང་ལྡན་པ་བརྗོད་པ་དང་།
en: May those who do not understand the conduct of beings understand the Dharma that is taught to be giving the teaching on the possession of virtuous conduct.

source: དབང་པོ་མཆོག་དང་མཆོག་མ་ལགས་པར་འཚལ་བ་རྣམས་ཀྱིས་ནི་ཤེས་རབ་སྒྲོན་མ་བརྗོད་པ་དང་།
en: May those who do not know of the higher and lower powers understand it to be giving the teaching on the lamp of wisdom.

source: ཕན་ཚུན་དུ་ཚིག་བརྗོད་པ་མ་འཚལ་བ་རྣམས་ཀྱིས་ནི་སྒྲ་ལ་འཇུག་པ་བརྗོད་པ་དང་།
en: May those who do not comprehend each other’s words understand it to be giving the teaching on entering sound.

source: ཆོས་ཀྱི་སྐུ་ཐོབ་པ་རྣམས་ཀྱིས་ནི་དམ་པའི་ཆོས་ཀྱི་ཚོགས་བསྒོམ་པ་བརྗོད་པ་དང་།
en: May those who have not attained the dharmakāya understand it to be giving the teaching on the meditation on dharmakāya.

source: དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་བྲལ་བ་རྣམས་ཀྱིས་ནི་མིག་མི་འཛུམས་པ་བརྗོད་པ་དང་།
en: May those who are bereft of seeing the Tathāgata understand it to be giving the teaching on having unblinking eyes.

source: དམིགས་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཁྲུགས་པ་རྣམས་ཀྱིས་ནི་དགོན་པ་བརྗོད་པ་དང་།
en: May those who are exposed to all objects of perception understand it to be giving the teaching on solitude.

source: ཆོས་ཀྱི་འཁོར་ལོ་མངོན་པར་བསྐོར་བར་འཚལ་བ་རྣམས་ཀྱིས་ནི་འཁོར་ལོ་དྲི་མ་མེད་པ་བརྗོད་པ་དང་།
en: May those who aspire to turning the wheel of the Dharma understand it to be giving the teaching on the stainless wheel.

source: རྒྱུ་མ་མཆིས་པའི་རིག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱིས་ནི་རིག་པ་ལ་བརྟེན་པའི་རྗེས་སུ་འཐུན་པ་བརྗོད་པ་དང་།
en: May those who have followed the knowledge that there is no cause understand it to be giving the teaching that accords with reliance on knowledge.

source: སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་པུ་ཐེར་ཟུག་ཏུ་བལྟ་བ་རྣམས་ཀྱིས་ནི་ལེགས་པར་བགྱིད་པ་རྣམ་པར་འབྱེད་པ་བརྗོད་པ་དང་།
en: May those who have an eternalist view of this single buddha realm understand it to be giving the teaching on the collection of good actions.

source: མཚན་དང་དཔེ་བྱད་ཀྱི་ས་བོན་བསྐྲུན་པ་རྣམས་ཀྱིས་ནི་རྒྱན་དང་ལྡན་པ་བརྗོད་པ་དང་།
en: May those who have planted the seeds for the signs and indications understand it to be giving the teaching on being adorned by them.

source: ཚིག་དང་སྒྲ་རབ་ཏུ་འབྱེད་པར་རྔོ་མི་ཐོགས་པ་རྣམས་ཀྱིས་ནི་སོ་སོར་བསྒྲུབ་པ་བརྗོད་པ་དང་།
en: May those who are incapable of differentiating between words and sounds understand it to be giving the teaching on elucidation. “ ‘

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་པར་འཚལ་བ་རྣམས་ཀྱིས་ནི་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་འཁྲུགས་པ་མ་མཆིས་པ་བརྗོད་པ་དང་།
en: May those who aspire to the wisdom of omniscience understand the Dharma that is taught to be giving the teaching on the undisturbed nature of phenomena.

source: ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ལ་ཡང་དང་ཡང་དུ་འཇུག་པ་རྣམས་ཀྱིས་ནི་བརྟན་པ་བརྗོད་པ་དང་།
en: May those who are revolving in the phenomena of the present understand it to be giving the teaching on stability.

source: ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་འཚལ་བ་རྣམས་ཀྱིས་ནི་མངོན་པར་ཤེས་པ་བརྗོད་པ་དང་།
en: May those who do not understand the nature of phenomena understand it to be giving the teaching on clairvoyances.

source: ཤེས་རབ་སྤངས་པ་རྣམས་ཀྱིས་ནི་ཉམས་པ་མ་མཆིས་པ་བརྗོད་པ་དང་།
en: May those who let their wisdom decline understand it to be giving the teaching on constancy.

source: ལམ་རྣམ་པར་འཁྲུགས་པ་རྣམས་ཀྱིས་ནི་འགྱུར་བ་མ་མཆིས་པ་བརྗོད་པ་དང་།
en: May those who have gone astray from the path understand it to be giving the teaching on immutability.
